## CRUD Operations in SQL

#### Create
#### Read
#### Update
#### Delete

In [34]:
pip install -U pandasql

Requirement already satisfied: pandasql in c:\users\mac\anaconda3\lib\site-packages (0.7.3)
Requirement already satisfied: sqlalchemy in c:\users\mac\anaconda3\lib\site-packages (from pandasql) (1.4.39)
Requirement already satisfied: pandas in c:\users\mac\anaconda3\lib\site-packages (from pandasql) (1.4.4)
Requirement already satisfied: numpy in c:\users\mac\anaconda3\lib\site-packages (from pandasql) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\mac\anaconda3\lib\site-packages (from pandas->pandasql) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\mac\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\mac\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (1.1.1)
Requirement already satisfied: six>=1.5 in c:\users\mac\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [35]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\mac\anaconda3\lib\site-packages (0.4.1)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\mac\anaconda3\lib\site-packages (from ipython-sql) (1.4.39)
Requirement already satisfied: six in c:\users\mac\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in c:\users\mac\anaconda3\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: ipython>=1.0 in c:\users\mac\anaconda3\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\mac\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\mac\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: traitlets>=4.2 in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: colorama in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.5)
Requirement already satisfied: jedi>=0.16 in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pickleshare in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: matplotlib-inline in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.6)
Requirement already satisfied: pygments in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\mac\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (63.4.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\mac\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\mac\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\mac\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Note: you may need to restart the kernel to use updated packages.

In [36]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [37]:
%sql sqlite://Mydata.db3

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite://'])
Invalid SQLite URL: sqlite://Mydata.db3
Valid SQLite URL forms are:
 sqlite:///:memory: (or, sqlite://)
 sqlite:///relative/path/to/file.db
 sqlite:////absolute/path/to/file.db
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite://'])

In [38]:
# Create table for data
%%sql sqlite://
CREATE TABLE contactInfo(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,  
    USERID int  NOT NULL UNIQUE, 
    PRIMARY KEY (USERID)
);

(sqlite3.OperationalError) table contactInfo already exists
[SQL: CREATE TABLE contactInfo(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,
    USERID int  NOT NULL UNIQUE,
    PRIMARY KEY (USERID)
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [39]:
%%sql sqlite://
INSERT INTO contactInfo VALUES ('Akinroye', 'Muideen', 8134324983);
INSERT INTO contactInfo VALUES ('Akinroye', 'Azeez', 7063684912);
INSERT INTO contactInfo VALUES ('Olanipekun', 'Abigeal', 8063362208);
INSERT INTO contactInfo VALUES ('Abiola', 'Olayanju', 7056434242);
INSERT INTO contactInfo VALUES ('Emannuel', 'Clement', 9078474743);

(sqlite3.OperationalError) table contactInfo has 4 columns but 3 values were supplied
[SQL: INSERT INTO contactInfo VALUES ('Akinroye', 'Muideen', 8134324983);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [40]:
# Read Data stored in the Table
sql_query = %sql SELECT * from contactInfo

 * sqlite://
Done.

In [41]:
sql_query

[('Olanipekun', 'Abigeal', 8063362208, None),
 ('Abiola', 'Olayanju', 7056434242, None),
 ('Emannuel', 'Clement', 9078474743, None)]

In [42]:
# Read Data stored in the Table
sql_query = %sql SELECT * FROM contactInfo WHERE USERID = 8134324983;

 * sqlite://
Done.

In [43]:
sql_query

[]

In [44]:
# Update Data stored in the Table
sql_query = %sql UPDATE contactInfo SET FirstName = 'Oyakilomeh' WHERE USERID = 7063684912;

 * sqlite://
0 rows affected.

In [45]:
sql_query = %sql SELECT * from contactInfo

 * sqlite://
Done.

In [46]:
sql_query

[('Olanipekun', 'Abigeal', 8063362208, None),
 ('Abiola', 'Olayanju', 7056434242, None),
 ('Emannuel', 'Clement', 9078474743, None)]

In [47]:
# Delete information stored in the table
sql_query = %sql DELETE FROM contactInfo WHERE USERID= 8134324983 OR USERID = 7063684912;

 * sqlite://
0 rows affected.

In [48]:
sql_query = %sql SELECT * from contactInfo

 * sqlite://
Done.

In [49]:
sql_query

[('Olanipekun', 'Abigeal', 8063362208, None),
 ('Abiola', 'Olayanju', 7056434242, None),
 ('Emannuel', 'Clement', 9078474743, None)]

In [50]:
sql_query = %sql ALTER TABLE contactInfo ADD Email VARCHAR(255)

 * sqlite://
(sqlite3.OperationalError) duplicate column name: Email
[SQL: ALTER TABLE contactInfo ADD Email VARCHAR(255)]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [51]:
sql_query = %sql SELECT * from contactInfo

 * sqlite://
Done.

In [52]:
sql_query

[('Olanipekun', 'Abigeal', 8063362208, None),
 ('Abiola', 'Olayanju', 7056434242, None),
 ('Emannuel', 'Clement', 9078474743, None)]